fix mermaid rendering errors
